RoanBrand/espix/sdkconfig.defaults.esp32s3
# espix — ESP32-S3 with 16MB flash and 8MB octal PSRAM (N16R8 modules),
# e.g. the ESP32-S3-DevKitC-1 v1.1. This is the default and the only variant
# espix has actually been run on.
#
# Other modules are selected by adding a file from boards/ to
# SDKCONFIG_DEFAULTS, which lands after this one and overrides it — see the
# Building section of the README.

CONFIG_IDF_TARGET="esp32s3"

#
# Flash
#
# The build targets the largest flash espix supports (16 MB), so the flash is
# addressable to the top; the image itself is flashed with the smallest table
# (8 MB), which is valid on any larger chip, and the loader writes the table for
# the physical flash it finds. One image then runs on 8 and 16 MB.
# See docs/OTA.md section 11.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/esp32s3-8mb.csv"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

#
# PSRAM — apps get loaded here, so it is not optional on this target.
#
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESPIX_PSRAM_MB=8
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

#
# Load relocated ELF text/data into PSRAM rather than internal SRAM. On S3 this
# relies on the ibus/dbus address mirror (ELF_LOADER_BUS_ADDRESS_MIRROR, which
# the component selects automatically for this target).
#
CONFIG_ELF_LOADER_LOAD_PSRAM=y

#
# CPU
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
